#        1         2         3         4         5         6         7         8         9        10         1         2
#23456789012345678901234567890123456789012345678901234567890123456789012345678901234567890123456789012345678901234567890
# 100枚のカードを下記ルールで裏返し裏のままのカード枚数を表示する              #
# 処理内容
#   最初100カードを裏返した状態とする。
#   先頭からn番目のカードを裏返す。そこからn-1枚ごとに裏返す100枚以上となれば
#   n+1として繰り返す
#     訳すと、100の配列を準備して、100回、iの倍数のカードを裏返す。(+1する)
#     最終的に偶数の配列が裏となる。
# 2026.10.11 S.TAKAHARA
#################################################################################
#################################################################################
# 100枚のカードを下記ルールで裏返し裏のままのカード枚数を表示する              #
# 処理内容
#   最初100カードを裏返した状態とする。
#   先頭からn番目のカードを裏返す。そこからn-1枚ごとに裏返す100枚以上となれば
#   n+1として繰り返す
#     訳すと、100の配列を準備して、100回、iの倍数のカードを裏返す。(+1する)
#     最終的に偶数の配列が裏となる。
# 引数 なし                                                             #
# 戻り値 なし                                                   #
# 注意 エラー処理していない。                                                   #
#      例えば、演算子[*/+- ]以外の場合エラーにするとか、数値判定とか            #
#      文字数チェックとか。今は、演算子文字列が固定で3個としている              #
#################################################################################
def ex03FlipTheCardOver() :
  intCardMax = 100
  intCard = [0] * intCardMax                                       # 結果格納用リストの初期化

  for intLoop in range( 2, intCardMax + 1 ) :
    for intLoop2 in range(intLoop, intCardMax, intLoop):
      intCard[ intLoop2 - 1 ] += 1
  ex03PrintList( intCard )
  ex03ResultList( intCard )

def ex03PrintList( listData : list ) :
  for intLoop in range(0,len(listData)) :
    intCard = 0 if listData[ intLoop] % 2 == 0 else 1
    print( intCard, end="" )
  print()

def ex03ResultList( listData : list ) :
  for intLoop in range(0,len(listData)) :
    if listData[ intLoop] % 2 == 0 :
      print(f"ura No = {intLoop + 1}")
##### End of File #####